---
kind: property
id: P:Autodesk.Revit.DB.DesignOption.IsPrimary
source: html/b8667ed2-af99-cf1c-2793-55ee5d6c092e.htm
---
# Autodesk.Revit.DB.DesignOption.IsPrimary Property

Determines whether this is a primary design option.

## Syntax (C#)
```csharp
public bool IsPrimary { get; }
```